[
	{
		"name": "Dr. Zvi Galil",
		"distinction": "Creator of OMSCS, Former Dean of Computing at Georgia Tech, Professor at Columbia University",
		"description": "Zvi Galil is noted for his research in algorithms, complexity, and cryptography. Former Dean of Computing at Georgia Tech, he has written over 200 scientific papers and is recognized for his contributions to computer science education.",
		"speakerPhoto": "/advisor-photos/zvi.jpg",
		"biographyLink": "https://www.scs.gatech.edu/people/zvi-galil",
		"markdownBiography": "# Zvi Galil\n\n## Early Life and Education\n\nZvi Galil was born on June 26, 1947, in Tel Aviv, Israel. He completed both his Bachelor of Science (1970) and Master of Science (1971) degrees in Applied Mathematics at Tel Aviv University, graduating summa cum laude. In 1975, he earned his Ph.D. in Computer Science from Cornell University, under the supervision of renowned computer science professor John Hopcroft. Following his Ph.D., Galil conducted post-doctorate research at IBM's Thomas J. Watson Research Center in Yorktown Heights, New York. [Wikipedia: Zvi Galil](https://en.wikipedia.org/wiki/Zvi_Galil)\n\n## Academic and Professional Career\n\n### Tel Aviv University\n\nFrom 1976 to 1995, Zvi Galil was a faculty member of the Computer Science Department at Tel Aviv University. He served as the chair of the department from 1979 to 1982. [Tel Aviv University](https://english.tau.ac.il)\n\n### Columbia University\n\nIn 1982, Galil joined the faculty of Columbia University. He chaired the Computer Science Department from 1989 to 1994 and became the Julian Clarence Levi Professor of Mathematical Methods and Computer Science in 1987. In 1995, he was appointed the Morris and Alma A. Schapiro Dean of Engineering at Columbia University's Fu Foundation School of Engineering & Applied Science, a position he held until 2007. During his tenure, he oversaw the naming of the school in honor of Chinese businessman Z. Y. Fu after a significant donation. [The New York Times](https://www.nytimes.com)\n\n### Tel Aviv University Presidency\n\nIn 2007, Zvi Galil became the President of Tel Aviv University. He resigned in 2009 and returned to the faculty as a professor of Computer Science. [Tel Aviv University](https://english.tau.ac.il)\n\n### Georgia Institute of Technology\n\nGalil was appointed as the John P. Imlay Jr. Dean of Computing at Georgia Institute of Technology in April 2010, a position he held until June 2019. During his tenure, he co-conceived the Online Master of Science in Computer Science (OMSCS) program with Udacity founder Sebastian Thrun, which became the largest online master's program in computer science in the United States. The OMSCS program has been widely recognized for its innovative approach to delivering high-quality, low-cost education at scale. [Georgia Tech College of Computing](https://www.cc.gatech.edu)\n\n### Current Roles\n\nAfter stepping down as Dean, Galil continues to serve as the Frederick G. Storey Chair in Computing and Executive Advisor to Online Programs at Georgia Tech. [Georgia Tech College of Computing](https://www.cc.gatech.edu)\n\n## Research Contributions\n\nZvi Galil's research interests encompass the design and analysis of algorithms, computational complexity, cryptography, and experimental design. He has published over 200 scientific papers and edited five books. Some of his notable research contributions include:\n\n- Co-founding the terms \"stringology\" and \"sparsification.\"\n- Developing real-time algorithms for string matching and palindrome recognition.\n- Improving time-optimal algorithms to be space optimal.\n- Designing parallel algorithms for string matching.\n- Developing algorithms for maximum weighted matching, trivalent graph isomorphism, and minimum weight spanning trees.\n- Introducing techniques like sparsification and sparse dynamic programming.\n\n[Cornell University](https://www.cs.cornell.edu)\n\n## Professional Service\n\nGalil has served in several significant professional roles, including:\n\n- Founding the Columbia University Theory Day in 1982, which continues as the New York Area Theory Day.\n- Serving as chairman of ACM SIGACT from 1983 to 1987.\n- Managing editor of the SIAM Journal on Computing (1991-1997) and editor in chief of the Journal of Algorithms (1988-2003).\n\n[The Wall Street Journal](https://www.wsj.com)\n\n## Awards and Honors\n\nZvi Galil has received numerous accolades for his contributions to computer science and engineering:\n\n- Fellow of the Association for Computing Machinery (1995) for fundamental contributions to algorithms and service to the theoretical computer science community.\n- Elected to the National Academy of Engineering (2004) for contributions to the design and analysis of algorithms.\n- Fellow of the American Academy of Arts and Sciences (2005).\n- The Zvi Galil Award for Student Life established by Columbia University (2008).\n- Great Teacher Award by the Columbia Society of Graduates (2009).\n- Honorary Doctor of Mathematics degree from the University of Waterloo (2012).\n\n[Forbes](https://www.forbes.com)\n\n## Personal Life\n\nZvi Galil is married to Dr. Bella S. Galil, a marine biologist. They have one son, Yair, who works as a corporate lawyer in New York. [Wikipedia: Zvi Galil](https://en.wikipedia.org/wiki/Zvi_Galil)\n\n## References\n\n- [Wikipedia: Zvi Galil](https://en.wikipedia.org/wiki/Zvi_Galil)\n- [Georgia Tech College of Computing](https://www.cc.gatech.edu)\n- [Tel Aviv University](https://english.tau.ac.il)\n- [Cornell University](https://www.cs.cornell.edu)\n- [The New York Times](https://www.nytimes.com)\n- [The Wall Street Journal](https://www.wsj.com)\n- [Forbes](https://www.forbes.com)\n\nFor more information, [email Zvi Galil](mailto:galil@cc.gatech.edu).",
		"markdownTimeline": "## Career Timeline\n\n- **1970**: Received Bachelor of Science in Applied Mathematics from Tel Aviv University [Tel Aviv University](https://english.tau.ac.il)\n- **1971**: Completed Master of Science in Applied Mathematics at Tel Aviv University [Tel Aviv University](https://english.tau.ac.il)\n- **1975**: Earned Ph.D. in Computer Science from Cornell University [Cornell University](https://www.cs.cornell.edu)\n- **1976**: Joined Tel Aviv University as faculty member in Computer Science Department [Tel Aviv University](https://english.tau.ac.il)\n- **1979-1982**: Served as chair of Computer Science Department at Tel Aviv University [Tel Aviv University](https://english.tau.ac.il)\n- **1982**: Joined Columbia University as faculty member [The New York Times](https://www.nytimes.com)\n- **1987**: Became Julian Clarence Levi Professor of Mathematical Methods and Computer Science at Columbia University [The New York Times](https://www.nytimes.com)\n- **1989-1994**: Chaired Computer Science Department at Columbia University [The New York Times](https://www.nytimes.com)\n- **1995-2007**: Served as Morris and Alma A. Schapiro Dean of Engineering at Columbia University [The New York Times](https://www.nytimes.com)\n- **2007-2009**: President of Tel Aviv University [Tel Aviv University](https://english.tau.ac.il)\n- **2010-2019**: John P. Imlay Jr. Dean of Computing at Georgia Institute of Technology [Georgia Tech College of Computing](https://www.cc.gatech.edu)\n- **2014**: Launched Online Master of Science in Computer Science (OMSCS) program at Georgia Tech [Georgia Tech College of Computing](https://www.cc.gatech.edu)\n- **2019-present**: Frederick G. Storey Chair in Computing and Executive Advisor to Online Programs at Georgia Tech [Georgia Tech College of Computing](https://www.cc.gatech.edu)",
		"slug": "zvi-galil"
	},
	{
		"name": "Dr. Edward Feigenbaum",
		"distinction": "Turing Award Winner, Professor Emeritus at Stanford University",
		"description": "Edward Feigenbaum is a pioneer in artificial intelligence, known as the 'father of expert systems.' He is a joint winner of the 1994 ACM Turing Award for his work in AI and expert systems.",
		"speakerPhoto": "/advisor-photos/edward.jpg",
		"biographyLink": "https://amturing.acm.org/award_winners/feigenbaum_4167235.cfm",
		"markdownBiography": "# Edward Feigenbaum\n\n## Early Life and Education\n\nEdward Albert Feigenbaum was born on January 20, 1936, in Weehawken, New Jersey. He was raised in a culturally Jewish family and spent his early years in North Bergen, New Jersey. Due to the lack of a local secondary school, Feigenbaum attended Weehawken High School, known for its college preparatory program. He was inducted into the high school's hall of fame in 1996. [Wikipedia](https://en.wikipedia.org/wiki/Edward_Feigenbaum)\n\nFeigenbaum pursued higher education at the Carnegie Institute of Technology (now Carnegie Mellon University), where he completed his undergraduate degree in 1956 and his Ph.D. in 1960. His doctoral thesis, supervised by Herbert A. Simon, led to the development of EPAM, one of the first computer models of human learning. [Carnegie Mellon University](https://www.cmu.edu/)\n\n## Career and Research\n\n### Early Career\n\nAfter completing a Fulbright Fellowship at the National Physical Laboratory in the United Kingdom, Feigenbaum joined the University of California, Berkeley in 1960 as a faculty member in the School of Business Administration. [Wikipedia](https://en.wikipedia.org/wiki/Edward_Feigenbaum)\n\n### Stanford University\n\nIn 1965, Feigenbaum joined Stanford University as one of the founding members of its computer science department. He served as the director of the Stanford Computation Center from 1965 to 1968 and established the Knowledge Systems Laboratory at Stanford. [Stanford University](https://www.stanford.edu/)\n\n### Contributions to AI and Expert Systems\n\nFeigenbaum is renowned for his pioneering work in the field of artificial intelligence, particularly in expert systems. He played a crucial role in several significant projects:\n- **EPAM**: One of the first models of human learning.\n- **Dendral**: A project that applied AI to organic chemistry, helping chemists identify unknown organic molecules.\n- **MYCIN**: An early expert system for medical diagnosis and therapy.\n- **ACME and SUMEX**: Important medical AI systems.\n\nFeigenbaum also co-founded the companies IntelliCorp and Teknowledge, which were instrumental in commercializing AI technologies. [ACM Turing Award](https://amturing.acm.org/award_winners/feigenbaum_2838108.cfm)\n\n## Honors and Awards\n\nFeigenbaum's contributions to computer science and artificial intelligence have been widely recognized:\n- **1984**: Selected as an initial fellow of the American College of Medical Informatics (ACMI).\n- **1986**: Elected a member of the National Academy of Engineering for his pioneering contributions to knowledge engineering and expert systems technology.\n- **1994**: Jointly awarded the Turing Award with Raj Reddy for pioneering the design and construction of large-scale AI systems.\n- **1997**: Received the U.S. Air Force Exceptional Civilian Service Award.\n- **2007**: Inducted as a fellow of the Association for Computing Machinery (ACM).\n- **2011**: Inducted into IEEE Intelligent Systems' AI's Hall of Fame for significant contributions to AI and intelligent systems.\n- **2012**: Made a fellow of the Computer History Museum for his pioneering work in AI and expert systems.\n- **2013**: Received the IEEE Computer Society Computer Pioneer Award.\n\n[ACM Fellows](https://awards.acm.org/fellows), [IEEE Intelligent Systems AI's Hall of Fame](http://www.computer.org/cms/Computer.org/ComputingNow/homepage/2011/0811/rW_IS_AIsHallofFame.pdf), [Computer History Museum](https://www.computerhistory.org/)\n\n## Publications\n\nFeigenbaum has edited and authored several influential works on artificial intelligence, including:\n- *Computers and Thought: A Collection of Articles* (1963)\n- *The Handbook of Artificial Intelligence*, Volumes 1-4 (1981-1989)\n\n[ACM Digital Library](https://dl.acm.org/profile/81100395477)\n\n## Legacy\n\nEdward Feigenbaum is often called the \"father of expert systems\" for his foundational work in AI. His contributions have had a lasting impact on the field, demonstrating the practical importance and potential commercial impact of AI technology. Today, he is a Professor Emeritus of Computer Science at Stanford University. [Stanford University](https://www.stanford.edu/)\n\n## References\n\n- [Edward Feigenbaum on Wikipedia](https://en.wikipedia.org/wiki/Edward_Feigenbaum)\n- [Carnegie Mellon University](https://www.cmu.edu/)\n- [Stanford University](https://www.stanford.edu/)\n- [Turing Award](https://amturing.acm.org/award_winners/feigenbaum_2838108.cfm)\n- [ACM Fellows](https://awards.acm.org/fellows)\n- [IEEE Intelligent Systems AI's Hall of Fame](http://www.computer.org/cms/Computer.org/ComputingNow/homepage/2011/0811/rW_IS_AIsHallofFame.pdf)\n- [Computer History Museum](https://www.computerhistory.org/)\n\n---\n\nThis biography has been compiled using various sources to ensure a detailed and comprehensive account of Edward Feigenbaum's life and achievements. For further reading, please refer to the provided hyperlinks.",
		"markdownTimeline": "## Career Timeline\n\n- **1956**: Completed undergraduate degree at Carnegie Institute of Technology (now Carnegie Mellon University) [Carnegie Mellon University](https://www.cmu.edu/)\n- **1960**: Received Ph.D. from Carnegie Institute of Technology; joined University of California, Berkeley as faculty member [Wikipedia](https://en.wikipedia.org/wiki/Edward_Feigenbaum)\n- **1965**: Joined Stanford University as founding member of computer science department [Stanford University](https://www.stanford.edu/)\n- **1965-1968**: Served as director of the Stanford Computation Center [Stanford University](https://www.stanford.edu/)\n- **1980s**: Co-founded IntelliCorp and Teknowledge [ACM Turing Award](https://amturing.acm.org/award_winners/feigenbaum_2838108.cfm)\n- **1984**: Selected as initial fellow of the American College of Medical Informatics (ACMI) [ACMI](https://www.amia.org/programs/acmi-fellowship)\n- **1986**: Elected member of the National Academy of Engineering [National Academy of Engineering](https://www.nae.edu/)\n- **1994**: Awarded the ACM Turing Award jointly with Raj Reddy [ACM Turing Award](https://amturing.acm.org/award_winners/feigenbaum_2838108.cfm)\n- **1997**: Received U.S. Air Force Exceptional Civilian Service Award [Wikipedia](https://en.wikipedia.org/wiki/Edward_Feigenbaum)\n- **2000**: Became Professor Emeritus at Stanford University [Stanford University](https://www.stanford.edu/)\n- **2007**: Inducted as fellow of the Association for Computing Machinery (ACM) [ACM Fellows](https://awards.acm.org/fellows)\n- **2011**: Inducted into IEEE Intelligent Systems' AI's Hall of Fame [IEEE Intelligent Systems](https://www.computer.org/csdl/magazine/ex)\n- **2012**: Made fellow of the Computer History Museum [Computer History Museum](https://www.computerhistory.org/)\n- **2013**: Received IEEE Computer Society Computer Pioneer Award [IEEE Computer Society](https://www.computer.org/)",
		"slug": "edward-feigenbaum"
	},
	{
		"name": "Dr. Moshe Vardi",
		"distinction": "University Professor at Rice University",
		"description": "Moshe Vardi is a University Professor and the Karen Ostrum George Distinguished Service Professor in Computational Engineering at Rice University. He is renowned for his contributions to logic and computation, database theory, and artificial intelligence.",
		"speakerPhoto": "/advisor-photos/moshe.jpg",
		"biographyLink": "https://profiles.rice.edu/faculty/moshe-y-vardi",
		"markdownBiography": "# Moshe Y. Vardi\n\n## Early Life and Education\n\nMoshe Ya'akov Vardi was born in 1954 in Israel. He pursued his undergraduate studies at [Bar-Ilan University](https://en.wikipedia.org/wiki/Bar-Ilan_University) and later received his Master of Science degree from the [Weizmann Institute of Science](https://en.wikipedia.org/wiki/Weizmann_Institute_of_Science). Vardi completed his PhD at the [Hebrew University of Jerusalem](https://en.wikipedia.org/wiki/Hebrew_University_of_Jerusalem) in 1981 under the supervision of Catriel Beeri. His doctoral thesis was titled \"The Implication Problem for Data Dependencies in the Relational Model\" ([Mathematics Genealogy Project](https://mathgenealogy.org/id.php?id=56451)).\n\n## Career and Research\n\nMoshe Vardi has had a distinguished career in both academia and industry. He began his postdoctoral research at [Stanford University](https://en.wikipedia.org/wiki/Stanford_University) and later joined IBM Research. In 1993, Vardi joined [Rice University](https://en.wikipedia.org/wiki/Rice_University), where he served as the chair of the computer science department from January 1994 until June 2002.\n\nAt Rice University, Vardi holds the title of Karen Ostrum George Distinguished Service Professor in Computational Engineering. He also serves as a faculty advisor for the [Ken Kennedy Institute](https://kenkennedy.rice.edu/people).\n\n### Research Interests\n\nVardi's research interests lie in the applications of logic to computer science. His work encompasses several specialized areas, including:\n\n- [Database theory](https://en.wikipedia.org/wiki/Database_theory)\n- [Finite model theory](https://en.wikipedia.org/wiki/Finite_model_theory)\n- [Knowledge of multi-agent systems](https://en.wikipedia.org/wiki/Multi-agent_system)\n- [Computer-aided verification and reasoning](https://en.wikipedia.org/wiki/Model_checking)\n- [Constraint satisfaction and database theory](https://en.wikipedia.org/wiki/Complexity_of_constraint_satisfaction)\n- [Common knowledge (logic)](https://en.wikipedia.org/wiki/Common_knowledge_(logic))\n- [Theoretical computer science](https://en.wikipedia.org/wiki/Theoretical_computer_science)\n\n### Publications and Editorial Work\n\nVardi has authored or co-authored over 700 technical papers and edited several collections. He is known for his books, including:\n\n- [Reasoning About Knowledge](https://mitpress.mit.edu/9780262562003/reasoning-about-knowledge/) (co-authored with Ronald Fagin, Joseph Halpern, and Yoram Moses)\n- [Finite Model Theory and Its Applications](https://link.springer.com/book/10.1007/978-3-540-68804-4) (co-authored with Erich Grädel, Phokion G. Kolaitis, Leonid Libkin, Maarten Marx, Joel Spencer, Yde Venema, and Scott Weinstein)\n\nVardi served as the editor-in-chief of [Communications of the ACM](https://cacm.acm.org/magazines) for a decade and is currently a senior editor.\n\n## Awards and Honors\n\nMoshe Vardi has received numerous awards and honors throughout his career. Some of the notable ones include:\n\n- **IBM Outstanding Innovation Awards**: Three times recipient\n- **Gödel Prize**: Co-winner in 2000 for work on temporal logic with finite automata ([Gödel Prize](https://en.wikipedia.org/wiki/Gödel_Prize))\n- **Paris Kanellakis Award**: Co-winner in 2005 ([Paris Kanellakis Award](https://en.wikipedia.org/wiki/Paris_Kanellakis_Award))\n- **Knuth Prize**: Winner in 2021 ([Knuth Prize](https://en.wikipedia.org/wiki/Knuth_Prize))\n- **Harry H. Goode Memorial Award**: Recipient in 2011 ([Harry H. Goode Memorial Award](https://en.wikipedia.org/wiki/Harry_H._Goode_Memorial_Award))\n- **ACM Presidential Award**: Recipient in 2008 and 2017\n- **Blaise Pascal Medal**: In computational science, awarded by the European Academy of Sciences in 2008\n- **Distinguished Service Award**: From the Computing Research Association in 2010\n- **Alonzo Church Award**: For Outstanding Contributions to Logic and Computation\n\n### Fellowships and Memberships\n\n- **Guggenheim Fellow**\n- **ACM Fellow**\n- **AAAI Fellow**\n- **Fellow of the American Association for the Advancement of Science**\n- **Foreign Member of the Royal Society** ([ForMemRS](https://royalsociety.org/people/moshe-vardi-13466/))\n- **Member of the US National Academy of Sciences** ([National Academy of Sciences](https://www.nasonline.org/member-directory/members/3015724.html))\n- **Member of the US National Academy of Engineering**\n- **Member of the Academia Europaea** ([Academia Europaea](https://www.ae-info.org/ae/Member/Vardi_Moshe))\n- **Fellow of the American Academy of Arts and Sciences**\n- **Fellow of the American Mathematical Society** (for contributions to the development and use of mathematical logic in computer science)\n\n### Honorary Doctorates\n\nVardi holds honorary doctorates from eight universities, including:\n\n- [Saarland University](https://en.wikipedia.org/wiki/Saarland_University), Germany\n- [University of Orléans](https://en.wikipedia.org/wiki/University_of_Orléans)\n- [Grenoble Alpes University](https://en.wikipedia.org/wiki/Grenoble_Alpes_University) (UGA), France\n- [Federal University of Rio Grande do Sul](https://en.wikipedia.org/wiki/Federal_University_of_Rio_Grande_do_Sul) (UFRGS), Brazil\n- [University of Liège](https://en.wikipedia.org/wiki/University_of_Li%C3%A8ge), Belgium\n- [TU Wien](https://en.wikipedia.org/wiki/TU_Wien), Austria\n- [University of Edinburgh](https://en.wikipedia.org/wiki/University_of_Edinburgh), Scotland\n- [University of Gothenburg](https://en.wikipedia.org/wiki/University_of_Gothenburg), Sweden\n\n## Personal Life\n\nMoshe Vardi resides in Houston, Texas, with his wife Pamela Geyer. His step-son, Aaron Hertzmann, is also a computer scientist at [Adobe Research](https://en.wikipedia.org/wiki/Adobe_Inc.).\n\nFor more detailed information, visit Moshe Vardi's [faculty profile on Rice University's website](https://profiles.rice.edu/faculty/moshe-y-vardi) and his [Google Scholar page](https://scholar.google.com/citations?user=DQaARsgAAAAJ).",
		"markdownTimeline": "## Career Timeline\n\n- **1954**: Born in Israel ([Mathematics Genealogy Project](https://mathgenealogy.org/id.php?id=56451))\n- **1981**: Received Ph.D. in Computer Science from the [Hebrew University of Jerusalem](https://en.wikipedia.org/wiki/Hebrew_University_of_Jerusalem)\n- **1985**: Joined IBM Almaden Research Center ([Rice University](https://profiles.rice.edu/faculty/moshe-y-vardi))\n- **1993**: Joined Rice University as Professor of Computer Science ([Rice University](https://profiles.rice.edu/faculty/moshe-y-vardi))\n- **1994-2002**: Served as chair of the computer science department at Rice University ([Rice University](https://profiles.rice.edu/faculty/moshe-y-vardi))\n- **2000**: Co-winner of the Gödel Prize ([Gödel Prize](https://en.wikipedia.org/wiki/Gödel_Prize))\n- **2001**: Became the Karen Ostrum George Distinguished Service Professor in Computational Engineering at Rice University ([Rice University](https://profiles.rice.edu/faculty/moshe-y-vardi))\n- **2002**: Elected to the National Academy of Engineering ([National Academy of Engineering](https://www.nae.edu/))\n- **2005**: Co-winner of the Paris Kanellakis Award ([Paris Kanellakis Award](https://en.wikipedia.org/wiki/Paris_Kanellakis_Award))\n- **2008**: Received the ACM Presidential Award and the Blaise Pascal Medal ([ACM](https://awards.acm.org/award_winners/vardi_2327153))\n- **2010**: Received the Distinguished Service Award from the Computing Research Association ([Computing Research Association](https://cra.org/))\n- **2011**: Received the Harry H. Goode Memorial Award ([Harry H. Goode Memorial Award](https://en.wikipedia.org/wiki/Harry_H._Goode_Memorial_Award))\n- **2017**: Received the ACM Presidential Award for the second time ([ACM](https://awards.acm.org/award_winners/vardi_2327153))\n- **2021**: Winner of the Knuth Prize ([Knuth Prize](https://en.wikipedia.org/wiki/Knuth_Prize))",
		"slug": "moshe-vardi"
	},
	{
		"name": "Dr. Jeffrey Ullman",
		"distinction": "Turing Award Winner, Professor Emeritus at Stanford University",
		"description": "Jeffrey Ullman is a renowned computer scientist known for his work in database theory, data mining, and software engineering. He is a co-recipient of the 2020 ACM Turing Award.",
		"speakerPhoto": "/advisor-photos/jeffrey.jpg",
		"biographyLink": "https://amturing.acm.org/award_winners/ullman_1054360.cfm",
		"markdownBiography": "# Jeffrey Ullman\n\n## Early Life and Education\n\nJeffrey David Ullman was born on November 22, 1942. He is an American computer scientist renowned for his contributions to the fields of database theory, database systems, and formal language theory. Ullman received his Bachelor of Science degree in engineering mathematics from Columbia University in 1963 and earned his PhD in electrical engineering from Princeton University in 1966. His doctoral thesis, \"Synchronization Error Correcting Codes,\" was supervised by Arthur Bernstein and Archie McKellar.\n\n## Academic Career\n\n### Bell Labs and Princeton University\n\nAfter completing his PhD, Ullman worked at Bell Labs for three years. In 1969, he joined Princeton University as an associate professor and was promoted to full professor in 1974.\n\n### Stanford University\n\nIn 1979, Ullman moved to Stanford University. He served as the department chair from 1990 to 1994 and was named the Stanford W. Ascherman Professor of Computer Science in 1994. He became an emeritus professor in 2003. At Stanford, Ullman has been influential in the development of computer science education and research. He is one of the founders of the field of database theory, and many of his PhD students have become prominent figures in the field.\n\n## Research Interests and Contributions\n\nUllman's research interests include database theory, data integration, data mining, and education using online infrastructure. He has authored numerous textbooks that are considered standards in their fields:\n\n- **Compilers**: \"Compilers: Principles, Techniques, and Tools,\" commonly known as the Dragon Book.\n- **Theory of Computation**: \"Introduction to Automata Theory, Languages, and Computation,\" also known as the Cinderella book.\n- **Data Structures**: \"Data Structures and Algorithms.\"\n- **Databases**: \"Database Systems: The Complete Book\" and \"Principles of Database and Knowledge-Base Systems.\"\n\nUllman co-founded Gradiance Corporation, which provides homework grading support for college courses, and he teaches courses on automata and mining massive datasets on the [Stanford Online](source) learning platform.\n\n## Awards and Honors\n\nJeffrey Ullman has received numerous prestigious awards throughout his career:\n\n- **ACM Fellow** (1994): Recognized for his contributions to computer science.\n- **Knuth Prize** (2000): Awarded for outstanding contributions to the foundations of computer science.\n- **IEEE John von Neumann Medal** (2010): Received for laying the foundations for the fields of automata and language theory and making seminal contributions to theoretical computer science.\n- **C&C Prize** (2017): Awarded by NEC Corporation, shared with John Hopcroft and Alfred Aho.\n- **Turing Award** (2020): Co-recipient with Alfred Aho for their work on programming language compilers and algorithms. This award is considered the highest distinction in computer science.\n\nUllman was elected as a member of the [National Academy of Sciences](source) in 2020. He also sits on the advisory board of TheOpenCode Foundation.\n\n## Controversies\n\nIn 2011, Ullman expressed his opposition to assisting Iranians in becoming graduate students at Stanford due to the anti-Israel stance of the Iranian government. This led to criticism from the National Iranian American Council, which called for disciplinary action against him for his \"racially discriminatory and inflammatory\" comments. Stanford University clarified that Ullman was expressing his personal views and was not involved in admissions decisions.\n\nIn April 2021, an open letter by CSForInclusion criticized the ACM and the Turing Award Committee for selecting Ullman as a recipient of the ACM A.M. Turing Award. In response, ACM reaffirmed its commitment to inclusion and diversity.\n\n## Books by Jeffrey Ullman\n\nJeffrey Ullman has authored and co-authored several influential books in computer science, including:\n\n- [Mining of Massive Datasets](source) (with Jure Leskovec and Anand Rajaraman), Prentice-Hall, Second edition 2014. ISBN: 978-1-1070-7723-2.\n- [Database Systems: The Complete Book](source) (with H. Garcia-Molina and J. Widom), Prentice-Hall, 2002. ISBN: 978-0-1303-1995-1.\n- [Introduction to Automata Theory, Languages, and Computation](source) (with J. E. Hopcroft and R. Motwani), Addison-Wesley, 1969, 1979, 2000. ISBN: 978-0-2010-2988-8.\n- Elements of ML Programming, Prentice-Hall, 1993, 1998. ISBN: 978-0-13-790387-0.\n- A First Course in Database Systems (with J. Widom), Prentice-Hall, 1997, 2002. ISBN: 978-0-13-861337-2.\n- Foundations of Computer Science (with A. V. Aho), Computer Science Press, 1992. ISBN: 978-0-7167-8233-9.\n- Principles of Database and Knowledge-Base Systems, two volumes, Computer Science Press, 1988, 1989. Volume 1: ISBN: 978-0-7167-8158-5, Volume 2: ISBN: 978-0-7167-8162-2.\n- [Compilers: Principles, Techniques, and Tools](source) (with A. V. Aho and R. Sethi), Addison-Wesley, 1977, 1986.\n- Computational Aspects of VLSI, Computer Science Press, 1984. ISBN: 978-0-914894-95-7.\n- Data Structures and Algorithms (with A. V. Aho and J. E. Hopcroft), Addison-Wesley, 1983. ISBN: 978-0-2010-0023-8.\n- [Principles of Compiler Design](source) (with A. V. Aho), Addison-Wesley, 1977.\n- Fundamental Concepts of Programming Systems, Addison-Wesley, 1976. ISBN: 0-201-07654-3.\n- The Design and Analysis of Computer Algorithms (with A. V. Aho and J. E. Hopcroft), Addison-Wesley, 1974. ISBN: 978-0-2010-0029-0.\n- Formal Languages and Their Relation to Automata (with J. E. Hopcroft), Addison-Wesley, 1969. ISBN: 978-0-2010-2983-3.",
		"markdownTimeline": "## Career Timeline\n\n- **1963**: Received Bachelor of Science degree in engineering mathematics from Columbia University [source]\n- **1966**: Earned PhD in electrical engineering from Princeton University [source]\n- **1966-1969**: Worked at Bell Labs [source]\n- **1969**: Joined Princeton University as an associate professor [source]\n- **1974**: Promoted to full professor at Princeton University [source]\n- **1979**: Moved to Stanford University as Professor of Computer Science [source]\n- **1990-1994**: Served as department chair at Stanford University [source]\n- **1994**: Named the Stanford W. Ascherman Professor of Computer Science at Stanford University [source]\n- **1994**: Elected ACM Fellow [source]\n- **2000**: Awarded the Knuth Prize [source]\n- **2003**: Became Professor Emeritus at Stanford University [source]\n- **2010**: Received the IEEE John von Neumann Medal [source]\n- **2017**: Awarded the C&C Prize [source]\n- **2020**: Elected as a member of the National Academy of Sciences [source]\n- **2020**: Co-recipient of the ACM Turing Award [source]",
		"slug": "jeffrey-ullman"
	},
	{
		"name": "Dr. Leslie Lamport",
		"distinction": "Turing Award Winner, Principal Researcher at Microsoft Research",
		"description": "Leslie Lamport is a computer scientist and mathematician. He received the 2013 Turing Award for his fundamental contributions to the theory and practice of distributed and concurrent systems.",
		"speakerPhoto": "/advisor-photos/leslie.jpg",
		"biographyLink": "https://amturing.acm.org/award_winners/lamport_1205376.cfm",
		"markdownBiography": "# Leslie Lamport\n\n## Early Life and Education\n\nLeslie B. Lamport was born on February 7, 1941, in New York City, into a Jewish family. His father, Benjamin Lamport, was an immigrant from Volkovisk in the Russian Empire, now Vawkavysk, Belarus. His mother, Hannah Lamport (née Lasser), hailed from the Austro-Hungarian Empire, now southeastern Poland. Lamport graduated from the Bronx High School of Science and went on to earn a B.S. in Mathematics from the Massachusetts Institute of Technology (MIT) in 1960. He later received both an M.A. (1963) and a Ph.D. (1972) in Mathematics from Brandeis University. His doctoral dissertation was titled \"The analytic Cauchy problem with singular data.\"\n\n## Career and Research\n\nLeslie Lamport's professional career began at Massachusetts Computer Associates, where he worked as a computer scientist from 1970 to 1977. He then joined SRI International (formerly Stanford Research Institute), serving from 1977 to 1985. From 1985 to 2001, Lamport was with Digital Equipment Corporation and Compaq. In 2001, he joined Microsoft Research in California.\n\n### Contributions to Distributed Systems\n\nLamport's seminal work in distributed systems has laid the groundwork for the field. His most notable papers include:\n\n- **\"Time, Clocks, and the Ordering of Events in a Distributed System\"**: This paper introduced the concept of logical clocks and the happened-before relationship. It received the Principles of Distributed Computing (PODC) Influential Paper Award in 2000 ([PODC Award](https://en.wikipedia.org/wiki/Dijkstra_Prize)).\n- **\"How to Make a Multiprocessor Computer That Correctly Executes Multiprocess Programs\"**: This work defined the notion of sequential consistency.\n- **\"The Byzantine Generals' Problem\"**: This paper addressed Byzantine fault tolerance, a critical concept in distributed computing.\n- **\"Distributed Snapshots: Determining Global States of a Distributed System\"**: This paper introduced the Chandy–Lamport algorithm for consistent global states.\n- **\"The Part-Time Parliament\"**: This paper described the Paxos algorithm for achieving consensus in a distributed system.\n\nThese contributions have significantly improved the correctness, performance, and reliability of distributed systems.\n\n### Development of LaTeX\n\nIn the early 1980s, while working on a personal book project, Lamport developed a set of macros based on Donald Knuth's TeX typesetting system. This set of macros became known as LaTeX. In 1983, Peter Gordon from Addison-Wesley approached Lamport to turn the LaTeX user manual into a book. Lamport released the first version of LaTeX in 1984 and subsequently authored \"LaTeX: A Document Preparation System,\" which became widely popular.\n\nIn 1989, Lamport handed over the maintenance and development of LaTeX to Frank Mittelbach and his team, who released LaTeX2e in 1994, the current version of LaTeX ([LaTeX History](https://en.wikipedia.org/wiki/LaTeX)).\n\n### Temporal Logic and TLA+\n\nLamport is also known for his work in temporal logic, introducing the Temporal Logic of Actions (TLA). He developed TLA+ as a language for specifying and reasoning about concurrent and reactive systems. His book, \"Specifying Systems: The TLA+ Language and Tools for Hardware and Software Engineers,\" describes TLA+ in detail ([TLA+](https://en.wikipedia.org/wiki/TLA%2B)).\n\n## Awards and Honors\n\nLeslie Lamport has received numerous awards and honors for his contributions:\n\n- **Turing Award (2013)**: Recognized for his fundamental contributions to distributed and concurrent systems ([Turing Award](https://en.wikipedia.org/wiki/Turing_Award)).\n- **National Academy of Engineering (1991)**: Elected for his contributions to concurrent and fault-tolerant computing.\n- **ACM Fellow (2014)**: For contributions to distributed and concurrent systems ([ACM Fellows](https://en.wikipedia.org/wiki/Association_for_Computing_Machinery)).\n- **IEEE Emanuel R. Piore Award (2004)** ([IEEE Emanuel R. Piore Award](https://en.wikipedia.org/wiki/IEEE_Emanuel_R._Piore_Award)).\n- **Dijkstra Prize (2000, 2005, 2014)**: For influential papers in distributed computing ([Dijkstra Prize](https://en.wikipedia.org/wiki/Dijkstra_Prize)).\n\nLamport also holds honorary doctorates from several European universities, including the University of Rennes, Christian Albrechts University of Kiel, École Polytechnique Fédérale de Lausanne (EPFL), University of Lugano, and Nancy-Université.\n\nHis extensive body of work has made him one of the most influential figures in computer science, particularly in the fields of distributed systems and document preparation systems.",
		"markdownTimeline": "## Career Timeline\n\n- **1960**: Earned B.S. in Mathematics from Massachusetts Institute of Technology (MIT) [MIT](https://www.mit.edu)\n- **1963**: Received M.A. in Mathematics from Brandeis University [Brandeis University](https://www.brandeis.edu)\n- **1970-1977**: Worked as a computer scientist at Massachusetts Computer Associates [Massachusetts Computer Associates](https://en.wikipedia.org/wiki/Massachusetts_Computer_Associates)\n- **1972**: Received Ph.D. in Mathematics from Brandeis University [Brandeis University](https://www.brandeis.edu)\n- **1977-1985**: Joined SRI International (formerly Stanford Research Institute) [SRI International](https://www.sri.com)\n- **1985-2001**: Worked at Digital Equipment Corporation and Compaq [Digital Equipment Corporation](https://en.wikipedia.org/wiki/Digital_Equipment_Corporation)\n- **1984**: Released the first version of LaTeX [LaTeX](https://www.latex-project.org)\n- **1991**: Elected to the National Academy of Engineering [National Academy of Engineering](https://www.nae.edu)\n- **2000**: Received the PODC Influential Paper Award [PODC](https://www.podc.org)\n- **2001**: Joined Microsoft Research in California [Microsoft Research](https://www.microsoft.com/en-us/research)\n- **2004**: Received the IEEE Emanuel R. Piore Award [IEEE](https://www.ieee.org)\n- **2013**: Awarded the ACM Turing Award [ACM](https://www.acm.org)\n- **2014**: Elected ACM Fellow [ACM](https://www.acm.org)\n- **2014**: Received the Dijkstra Prize for the third time [Dijkstra Prize](https://en.wikipedia.org/wiki/Dijkstra_Prize)",
		"slug": "leslie-lamport"
	}
]
