[
	{
		"name": "Dr. James Gosling",
		"dateTime": "October 18th, 1pm EST",
		"isoDate": "2024-10-18T13:00:00-04:00",
		"description": "Dr. James Gosling, often referred to as the 'father of Java', is a renowned computer scientist whose creation of the Java programming language has revolutionized software development. His work has enabled the 'write once, run anywhere' paradigm, fundamentally changing how applications are developed and deployed across various platforms. Dr. Gosling's contributions have had a profound impact on the tech industry, influencing everything from web applications to mobile devices, and continue to shape the landscape of modern computing.",
		"rsvpLink": "https://lu.ma/439g8d8z",
		"turingAwardWinner": false,
		"speakerPhoto": "/speaker-photos/james_gosling.jpg",
		"talkTitle": "Question & Answer",
		"recordingLink": "https://youtu.be/POY2UVRf5Hc",
		"markdownBiography": "# James Gosling\n\n## Early Life and Education\n\nJames Arthur Gosling, born on May 19, 1955, in Calgary, Alberta, Canada, is a renowned Canadian computer scientist widely recognized for his pivotal role in the creation and development of the Java programming language. Gosling attended William Aberhart High School in Calgary, where he began showcasing his technical prowess by writing software to analyze data from the ISIS 2 satellite for the University of Calgary's physics department.\n\nGosling pursued higher education at the University of Calgary, earning a Bachelor of Science degree in 1977. Following this, he attended Carnegie Mellon University, where he obtained his MA and PhD in computer science in 1983. During his time at Carnegie Mellon, he developed significant projects such as Gosling Emacs, a version of Emacs, and a multi-processor version of Unix for a 16-way computer system.\n\n## Career and Contributions\n\n### Sun Microsystems\n\nJames Gosling's professional journey is most notably marked by his tenure at Sun Microsystems, where he worked from 1984 to 2010. At Sun, he invented NeWS, an early Unix windowing system, although it did not gain widespread adoption due to its licensing model. However, Gosling's most significant contribution came in the form of the Java programming language, which he conceived and developed in 1994.\n\nGosling's inspiration for Java stemmed from his experience in writing a program to port software from a PERQ by translating Perq Q-Code to VAX assembler and emulating the hardware. His work on Java included designing the original compiler and virtual machine, which played a crucial role in making Java an architecture-neutral and widely distributed programming language. [source](https://en.wikipedia.org/wiki/James_Gosling).\n\n### Post-Sun Career\n\nAfter leaving Sun Microsystems following its acquisition by Oracle Corporation in 2010, Gosling had a brief stint at Google in 2011. He then joined Liquid Robotics, a startup focused on ocean data services, where he worked until its acquisition by Boeing in 2016. Following this, Gosling took up a role at Amazon Web Services as a Distinguished Engineer in May 2017. He retired in July 2024. \n\nGosling also serves as an advisor at the Scala company Lightbend, an Independent Director at Jelastic, a Strategic Advisor for Eucalyptus, and a board member of DIRTT Environmental Solutions.\n\n## Awards and Honors\n\nJames Gosling's contributions to computer science have been recognized with numerous prestigious awards and honors:\n\n- **2002**: Awarded The Economist Innovation Award.\n- **2002**: Received the USENIX Lifetime Achievement Award, known as The Flame Award.\n- **2004**: Elected as a Foreign Member of the National Academy of Engineering for his work on Java.\n- **2007**: Made an Officer of the Order of Canada, the second-highest civilian honor in Canada.\n- **2013**: Became a Fellow of the Association for Computing Machinery.\n- **2015**: Awarded the IEEE John von Neumann Medal.\n- **2019**: Named a Computer History Museum Fellow for his work on Java.\n\n## Publications\n\nJames Gosling has co-authored several influential books on Java programming:\n\n- Ken Arnold, James Gosling, David Holmes, *The Java Programming Language*, Fourth Edition, Addison-Wesley Professional, 2005, ISBN 0-321-34980-6.\n- James Gosling, Bill Joy, Guy L. Steele Jr., Gilad Bracha, *The Java Language Specification*.\n\n## Personal Life\n\nGosling has two children, Katie and Kelsey, who are half-siblings from his two marriages. Despite his professional achievements, he has maintained a low profile regarding his personal life.\n\n## Legacy\n\nJames Gosling's legacy in the world of computer science is indelibly linked to his creation of the Java programming language, which continues to be a cornerstone of modern software development. His vision for an architecture-neutral programming language has enabled countless applications and systems, solidifying his place as a pioneer and innovator in the field.",
		"markdownTimeline": "## Career Timeline\n\n- **1977**: Earned Bachelor of Science degree from the University of Calgary\n- **1983**: Obtained MA and PhD in computer science from Carnegie Mellon University\n- **1984**: Joined Sun Microsystems\n- **1994**: Conceived and developed the Java programming language [source](https://en.wikipedia.org/wiki/James_Gosling)\n- **2002**: Awarded The Economist Innovation Award and USENIX Lifetime Achievement Award\n- **2004**: Elected as a Foreign Member of the National Academy of Engineering\n- **2007**: Made an Officer of the Order of Canada\n- **2010**: Left Sun Microsystems after its acquisition by Oracle Corporation\n- **2011**: Brief stint at Google\n- **2011-2016**: Worked at Liquid Robotics\n- **2013**: Became a Fellow of the Association for Computing Machinery\n- **2015**: Awarded the IEEE John von Neumann Medal\n- **2017**: Joined Amazon Web Services as a Distinguished Engineer\n- **2019**: Named a Computer History Museum Fellow\n- **2024**: Retired from Amazon Web Services",
		"slug": "james-gosling"
	},
	{
		"name": "Dr. Joseph Sifakis",
		"dateTime": "October 4th, 12pm EST",
		"isoDate": "2024-10-04T12:00:00-04:00",
		"description": "Dr. Joseph Sifakis is a pioneering computer scientist and 2007 Turing Award recipient, sharing the honor with Edmund M. Clarke and E. Allen Emerson. His groundbreaking work on formal verification of systems and the development of model checking has revolutionized the field of computer-aided verification. Dr. Sifakis's contributions have fundamentally transformed how we ensure the reliability and security of software and hardware systems, setting new standards for system design and verification that continue to shape the industry today.",
		"rsvpLink": "https://lu.ma/5zign4v1",
		"turingAwardWinner": true,
		"speakerPhoto": "/speaker-photos/joseph.jpg",
		"turingLink": "https://amturing.acm.org/award_winners/sifakis_1701095.cfm",
		"talkTitle": "Question & Answer",
		"recordingLink": "https://youtu.be/nbvRRtzclNs",
		"markdownBiography": "# Dr. Joseph Sifakis\n\nDr. Joseph Sifakis is a pioneering computer scientist known for his work in formal verification of systems. He received the 2007 Turing Award, sharing it with Edmund M. Clarke and E. Allen Emerson, for their role in developing model-checking techniques.\n\n## Early Life and Education\n\nJoseph Sifakis was born on December 26, 1946, in Heraklion, Crete, Greece. He pursued his initial education in Greece, studying Electrical Engineering at the National Technical University of Athens. Sifakis then moved to France on a scholarship to further his studies in Computer Science at the University of Grenoble. He received his engineering doctorate in 1974 and a state doctorate in 1979 from the University of Grenoble [source](https://tel.archives-ouvertes.fr/tel-00010598).\n\n## Academic and Professional Career\n\nJoseph Sifakis has had a distinguished career in the field of computer science, specifically in system verification and formal methods. He is a Research Director Emeritus at the Centre national de la recherche scientifique (CNRS) and the founder of the VERIMAG laboratory near Grenoble [source](https://www.verimag.fr). At VERIMAG, Sifakis has spearheaded research and development in model checking and embedded systems.\n\n## Research Contributions\n\nSifakis's work has been instrumental in advancing the field of model checking, a technique used to automatically verify the correctness of software and hardware systems. His contributions have significantly improved the reliability and safety of complex systems, particularly in critical domains such as aerospace, automotive, and healthcare.\n\nSifakis is particularly renowned for his work on model checking, a technique for verifying the correctness of systems. This work earned him the 2007 Turing Award, shared with Edmund M. Clarke and E. Allen Emerson [source](https://awards.acm.org/award_winners/sifakis_1701095).\n\nHe also founded the Computer Aided Verification (CAV) conference in 1989 in Grenoble with Edmund M. Clarke and Amir Pnueli [source](https://en.wikipedia.org/wiki/Computer_Aided_Verification).\n\nSifakis has collaborated on various verification tools and methodologies, including the CESAR verification tool, IF toolset, Kronos, CADP, and TGV [source](https://www.irisa.fr/vertecs/Logiciels/TGV.html). His research has also delved into the verification of timed and hybrid systems and the synthesis of timed systems with notable collaborators like Thomas Henzinger and Amir Pnueli [source](https://doi.org/10.1016%2F0304-3975%2894%2900202-T).\n\n### Leadership and Teaching\n\nFrom 2004 to 2012, Sifakis coordinated the ARTIST European Network of Excellence for research on Embedded Systems [source](http://www.artist-embedded.org/artist/-Strategic-Management-Board-.html). He also held the INRIA-Schneider endowed industrial chair from 2008 to 2011 and served as a full professor and the Director of the Rigorous System Design Laboratory at the School of Computer and Communication Sciences at EPFL from 2011 to 2016 [source](http://actu.epfl.ch/news/epfl-appoints-new-professors-3/).\n\nSifakis has been a visiting professor at Tsinghua University (2011–2012) and SUSTech (2019) [source](https://twitter.com/SUSTechSZ/status/1090438449369239552).\n\n### Research Impact\n\nHis work has significantly impacted the development of safety-critical systems, particularly through collaborations with industry giants like Airbus and Schneider Electric. At VERIMAG, he contributed to the development of the SCADE synchronous programming environment, which is instrumental in safety-critical software development [source](https://www.ansys.com/products/embedded-software/ansys-scade-suite).\n\nOver the past two decades, Sifakis has focused on rigorous component-based design using the BIP component framework and more recently on the design of trustworthy autonomous systems, including self-driving cars [source](https://ieeexplore.ieee.org/document/1698716).",
		"markdownTimeline": "## Career Timeline\n\n- **1974**: Obtained Ph.D. in Computer Science from the University of Grenoble [source](https://tel.archives-ouvertes.fr/tel-00010598)\n- **1979**: Received state doctorate from the University of Grenoble [source](https://tel.archives-ouvertes.fr/tel-00010598)\n- **1983**: Founded the Verimag laboratory [source](https://www.verimag.fr)\n- **1989**: Co-founded the Computer Aided Verification (CAV) conference [source](https://en.wikipedia.org/wiki/Computer_Aided_Verification)\n- **2004-2012**: Coordinated the ARTIST European Network of Excellence [source](http://www.artist-embedded.org/artist/-Strategic-Management-Board-.html)\n- **2007**: Awarded the ACM Turing Award [source](https://awards.acm.org/award_winners/sifakis_1701095)\n- **2008**: Appointed CNRS Research Director\n- **2008-2011**: Held the INRIA-Schneider endowed industrial chair [source](http://actu.epfl.ch/news/epfl-appoints-new-professors-3/)\n- **2011-2016**: Founded and directed the RiSD (Rigorous System Design) laboratory at EPFL [source](http://actu.epfl.ch/news/epfl-appoints-new-professors-3/)\n- **2011-2012**: Visiting professor at Tsinghua University [source](https://twitter.com/SUSTechSZ/status/1090438449369239552)\n- **2019**: Visiting professor at SUSTech [source](https://twitter.com/SUSTechSZ/status/1090438449369239552)\n\n## Awards and Honors\n\n- **Turing Award (2007)**: For his contributions to model checking [source](https://awards.acm.org/award_winners/sifakis_1701095)\n- **Leonardo da Vinci Medal (2012)**: Awarded by SEFI [source](https://www.sefi.be/activities/recognitions/#1498654424246-f2caaa57-9bc5)\n- **Grand Officer of the National Order of Merit, France (2008)**: [source](https://en.wikipedia.org/wiki/National_Order_of_Merit_(France))\n- **Commander of the Legion of Honor, France (2011)**: [source](https://en.wikipedia.org/wiki/Legion_of_Honor)\n- **Member of the French Academy of Sciences (2010)**: [source](https://en.wikipedia.org/wiki/French_Academy_of_Sciences)\n- **Member of Academia Europaea (2008)**: [source](https://en.wikipedia.org/wiki/Academia_Europaea)\n- **Member of the French Academy of Engineering (2008)**: [source](https://en.wikipedia.org/wiki/French_Academy_of_Technologies)\n- **Member of the American Academy of Arts and Sciences (2015)**: [source](https://en.wikipedia.org/wiki/American_Academy_of_Arts_and_Sciences)\n- **Member of the National Academy of Engineering (2017)**: [source](https://www.nae.edu/204037/Dr-Joseph-Sifakis)\n- **Foreign Member of the Chinese Academy of Sciences (2019)**: [source](https://en.wikipedia.org/wiki/Chinese_Academy_of_Sciences)",
		"slug": "joseph-sifakis"
	},
	{
		"name": "Dr. Leslie Valiant",
		"dateTime": "October 11th, 12pm EST",
		"isoDate": "2024-10-11T12:00:00-04:00",
		"description": "Dr. Leslie Valiant, honored with the 2010 Turing Award, is a visionary computer scientist whose work has redefined the landscape of computational learning theory and artificial intelligence. His pioneering development of the 'probably approximately correct' (PAC) learning model has become a cornerstone in machine learning theory and practice. Dr. Valiant's groundbreaking contributions continue to drive innovation in AI algorithms and applications, influencing countless advancements in the field.",
		"rsvpLink": "https://lu.ma/u0dftmlv",
		"turingAwardWinner": true,
		"speakerPhoto": "/speaker-photos/leslie_valiant.jpg",
		"turingLink": "https://amturing.acm.org/award_winners/valiant_2612174.cfm",
		"talkTitle": "Question & Answer",
		"recordingLink": "",
		"markdownBiography": "# Leslie Gabriel Valiant\n\n## Early Life and Education\n\nLeslie Gabriel Valiant was born on March 28, 1949, in Budapest, the Hungarian Republic. He was born to a chemical engineer father and a translator mother. Valiant's educational journey began at King's College, University of Cambridge, where he obtained his Bachelor of Arts (BA) degree. He then pursued a Master of Science (MS) degree at Imperial College London. Valiant completed his academic qualifications with a Ph.D. in computer science from the University of Warwick in 1974. His doctoral thesis was titled \"Decision Procedures for Families of Deterministic Pushdown Automata\" under the supervision of Mike Paterson [source](https://mathgenealogy.org/id.php?id=18757).\n\n## Academic and Professional Career\n\nValiant's illustrious career in theoretical computer science has seen him contribute significantly to multiple fields, including mathematics, theoretical computer science, computational learning theory, and theoretical neuroscience. He began his teaching career at Carnegie Mellon University, followed by positions at the University of Leeds and the University of Edinburgh. In 1982, he joined Harvard University, where he is currently the T. Jefferson Coolidge Professor of Computer Science and Applied Mathematics [source](https://people.seas.harvard.edu/~valiant).\n\n### Key Contributions\n\n#### Complexity Theory\n\nValiant introduced the notion of #P-completeness (Sharp-P completeness), significantly impacting the understanding of computational intractability in enumeration and reliability problems. His work in this area is seminal and has laid the foundation for further research in complexity theory [source](https://doi.org/10.1137%2F0208032).\n\n#### Probably Approximately Correct (PAC) Learning\n\nOne of Valiant's most influential contributions is the Probably Approximately Correct (PAC) learning model. This model formed the theoretical basis for the field of computational learning theory and has been a cornerstone for the development of machine learning [source](https://amturing.acm.org/award_winners/valiant_2612174.cfm).\n\n#### Holographic Algorithms\n\nValiant also pioneered the concept of holographic algorithms, which was inspired by quantum computation models. This innovative approach has furthered the understanding and development of algorithms in computer science.\n\n#### Bulk Synchronous Parallel (BSP) Model\n\nIn computer systems, Valiant is renowned for introducing the Bulk Synchronous Parallel (BSP) processing model. This model has been instrumental in shaping parallel and distributed computing architectures. It has influenced large-scale computation frameworks like Google's MapReduce and Facebook's graph analytics systems.\n\n### Automata Theory\n\nValiant's work in automata theory includes an algorithm for context-free parsing, which remains the asymptotically fastest known algorithm in this area.\n\n### Computational Neuroscience\n\nIn recent years, Valiant has focused on computational neuroscience, particularly in understanding memory and learning processes. His 2013 book, \"Probably Approximately Correct: Nature's Algorithms for Learning and Prospering in a Complex World,\" delves into the intersection of evolutionary biology and computational learning.\n\n## Awards and Honors\n\nValiant's groundbreaking work has earned him numerous prestigious awards and honors:\n\n- **Nevanlinna Prize (1986)**: Awarded for outstanding contributions to mathematical aspects of information science.\n- **Knuth Prize (1997)**: Recognizes outstanding contributions to the foundations of computer science.\n- **EATCS Award (2008)**: Honoring extensive and widely recognized contributions to theoretical computer science.\n- **Turing Award (2010)**: Often regarded as the \"Nobel Prize of Computing,\" this award recognized Valiant for his transformative contributions to the theory of computation. The citation highlighted his work on PAC learning, complexity of enumeration, algebraic computation, and parallel and distributed computing [source](https://amturing.acm.org/award_winners/valiant_2612174.cfm).\n\nHe was elected a Fellow of the Royal Society (FRS) in 1991 [source](https://royalsociety.org/people/leslie-valiant-12451/), a Fellow of the Association for the Advancement of Artificial Intelligence (AAAI) in 1992, and a member of the United States National Academy of Sciences in 2001.\n\n### Personal Life\n\nValiant has two sons, Gregory Valiant and Paul Valiant, both of whom are also theoretical computer scientists.",
		"markdownTimeline": "## Career Timeline\n\n- **1974**: Received Ph.D. in Computer Science from the University of Warwick [source](https://mathgenealogy.org/id.php?id=18757)\n- **1982**: Joined Harvard University as a professor [source](https://people.seas.harvard.edu/~valiant)\n- **1985**: Introduced the PAC learning model\n- **1986**: Awarded the Nevanlinna Prize\n- **1991**: Elected Fellow of the Royal Society (FRS) [source](https://royalsociety.org/people/leslie-valiant-12451/)\n- **1992**: Elected Fellow of the Association for the Advancement of Artificial Intelligence (AAAI)\n- **1997**: Awarded the Knuth Prize\n- **2001**: Elected member of the United States National Academy of Sciences\n- **2008**: Received the EATCS Award\n- **2010**: Awarded the ACM Turing Award [source](https://amturing.acm.org/award_winners/valiant_2612174.cfm)\n- **2013**: Published \"Probably Approximately Correct: Nature's Algorithms for Learning and Prospering in a Complex World\"",
		"slug": "leslie-valiant"
	},
	{
		"name": "Dr. Vint Cerf",
		"dateTime": "November 1st, 12pm EST",
		"isoDate": "2024-11-01T12:00:00-04:00",
		"description": "Dr. Vint Cerf, often hailed as one of the 'fathers of the Internet', is a pioneering computer scientist whose work has fundamentally shaped our modern digital world. Awarded the 2004 Turing Award alongside Robert E. Kahn, Dr. Cerf co-designed the TCP/IP protocols and the architecture of the Internet, laying the foundation for global connectivity. His visionary contributions continue to underpin the entire structure of internet communication, enabling the digital revolution that defines our era.",
		"rsvpLink": "https://lu.ma/noyfukyk",
		"turingAwardWinner": true,
		"speakerPhoto": "/speaker-photos/vint.jpg",
		"turingLink": "https://amturing.acm.org/award_winners/cerf_1083211.cfm",
		"talkTitle": "Question & Answer",
		"recordingLink": "https://youtu.be/we-klbTwAAs?si=bCgDGV66JGXwdgKz",
		"markdownBiography": "# Vint Cerf: Father of the Internet\n\n## Early Life and Education\nVinton G. Cerf, widely known as one of the \"Fathers of the Internet,\" was born on June 23, 1943. He holds a Bachelor of Science degree in Mathematics from Stanford University and Master of Science and Ph.D. degrees in Computer Science from UCLA.\n\n## Career Milestones\n\n### DARPA (1976-1982)\nDuring his tenure with the U.S. Department of Defense's Advanced Research Projects Agency (DARPA) from 1976 to 1982, Cerf played a key role in leading the development of Internet and Internet-related packet data transport and security technologies.\n\n### MCI (1982-1986, 1994-2005)\nAs vice president of MCI Digital Information Services from 1982 to 1986, Cerf led the engineering of MCI Mail, the first commercial email service to be connected to the Internet. From 1994 to 2005, he served as the senior vice president of Technology Strategy and later as MCI's senior vice president of Architecture and Technology.\n\n### Corporation for National Research Initiatives (1986-1994)\nBefore rejoining MCI in 1994, Cerf was vice president of the Corporation for National Research Initiatives (CNRI), where he worked on information infrastructure and digital libraries.\n\n### Google (2005-Present)\nSince October 2005, Cerf has served as vice president and chief Internet evangelist for Google, contributing to global policy development and the continued standardization and spread of the Internet.\n\n## Key Contributions and Achievements\n\n### TCP/IP Protocols\nCerf is the co-designer of the TCP/IP protocols and the architecture of the Internet. This groundbreaking work laid the foundation for the modern Internet.\n\n### Awards and Honors\n- **U.S. National Medal of Technology** (1997) - Awarded by President Clinton [source](https://www.nationalmedals.org/laureates/vinton-gray-cerf).\n- **ACM Turing Award** (2004) - Known as the \"Nobel Prize of Computer Science\" [source](https://amturing.acm.org/award_winners/cerf_1082127.cfm).\n- **Presidential Medal of Freedom** (2005) - The highest civilian award in the United States, awarded by President George W. Bush [source](https://georgewbush-whitehouse.archives.gov/news/releases/2005/11/20051109-10.html).\n- **Japan Prize** (2008) - Awarded for his work on the Internet protocols.\n- **Queen Elizabeth Prize in Engineering** (2013).\n- **Franklin Medal** (2018) - Awarded for his contributions to the Internet.\n- **IEEE Medal of Honor** (2023).\n- **Marconi Society Lifetime Achievement Award** (2023).\n\n### Honors and Memberships\n- Officer of the French Legion d'Honneur (2014).\n- Foreign Member of the British Royal Society (2016).\n- Fellow of the IEEE, ACM, American Association for the Advancement of Science, American Academy of Arts and Sciences, International Engineering Consortium, Computer History Museum, Annenberg Center for Communications at USC, Swedish Royal Academy of Engineering, American Philosophical Society, Hasso Plattner Institute.\n- Member of the US National Academy of Engineering and US National Academy of Science.\n\n### Advisory Roles\nCerf serves as an advisor to many US Government agencies including the National Science Foundation, NASA, and the US Departments of Defense, Energy, and Commerce. He was appointed by President Obama to serve a six-year term on the National Science Board starting in May 2012.\n\n### Leadership in Professional Organizations\n- **President of the Association for Computing Machinery (ACM)** (2012-2014).\n- **Chairman of the Internet Corporation for Assigned Names and Numbers (ICANN)** (2000-2007).\n- **Founding President of the Internet Society** (1992-1995).\n\n## Personal Life\nCerf and his wife, Sigrid, were married in 1966 and have two sons, David and Bennett. His personal interests include fine wine, gourmet cooking, and science fiction.\n\n## Notable Appearances\nCerf has served as a technical advisor to production for \"Gene Roddenberry's Earth: The Final Conflict\" and made a special guest appearance on the program in May 1998. He has appeared on television programs such as NextWave with Leonard Nimoy and co-hosted World Business Review with Alexander Haig and Caspar Weinberger. In July 2014, he appeared on the Colbert Report television show.\n\nFor more detailed information on Vint Cerf's life and achievements, you can visit his [official biography](https://www.internethalloffame.org/vint-cerf) and [Google profile](https://about.google/our-story/leadership/#vint-cerf).",
		"markdownTimeline": "## Career Timeline\n\n- **1965**: Graduated from Stanford University with a B.S. in Mathematics\n- **1972**: Earned Ph.D. in Computer Science from UCLA\n- **1973**: Began work on TCP/IP protocols with Bob Kahn\n- **1976-1982**: Worked at DARPA, overseeing the development of Internet and Internet-related data packet and security technologies\n- **1982-1986**: Vice president of MCI Digital Information Services\n- **1986-1994**: Vice president of the Corporation for National Research Initiatives (CNRI)\n- **1992-1995**: Served as the founding president of the Internet Society\n- **1994-2005**: Returned to MCI as senior vice president of Technology Strategy\n- **1997**: Awarded the U.S. National Medal of Technology [source](https://www.nationalmedals.org/laureates/vinton-gray-cerf)\n- **2000-2007**: Served as chairman of ICANN\n- **2004**: Awarded the ACM Turing Award [source](https://amturing.acm.org/award_winners/cerf_1082127.cfm)\n- **2005**: Awarded the Presidential Medal of Freedom [source](https://georgewbush-whitehouse.archives.gov/news/releases/2005/11/20051109-10.html)\n- **2005-Present**: Joined Google as Vice President and Chief Internet Evangelist\n- **2008**: Received the Japan Prize\n- **2012-2014**: Served as President of the Association for Computing Machinery (ACM)\n- **2013**: Awarded the Queen Elizabeth Prize in Engineering\n- **2014**: Appointed as Officer of the French Legion d'Honneur\n- **2016**: Elected as a Foreign Member of the British Royal Society\n- **2018**: Awarded the Franklin Medal\n- **2023**: Received the IEEE Medal of Honor and the Marconi Society Lifetime Achievement Award",
		"slug": "vint-cerf"
	},
	{
		"name": "Dr. Geoffrey Hinton",
		"dateTime": "November 8th, 1pm EST",
		"isoDate": "2024-11-08T13:00:00-05:00",
		"description": "Dr. Geoffrey Hinton, renowned as the 'godfather of deep learning', is a cognitive psychologist and computer scientist who has revolutionized the field of artificial intelligence. Awarded the 2018 Turing Award alongside Yoshua Bengio and Yann LeCun, his pioneering work on artificial neural networks and deep learning algorithms has been instrumental in propelling machine learning and AI to new heights. Dr. Hinton's groundbreaking research continues to drive innovation across numerous industries, from healthcare to autonomous systems, reshaping our understanding of machine intelligence.",
		"rsvpLink": "https://lu.ma/li4p47k5",
		"turingAwardWinner": true,
		"speakerPhoto": "/speaker-photos/geoffrey.jpg",
		"turingLink": "https://amturing.acm.org/award_winners/hinton_4791679.cfm",
		"talkTitle": "Question & Answer",
		"recordingLink": "",
		"markdownBiography": "# Geoffrey Hinton\n\n## Early Life and Education\n\nGeoffrey Everest Hinton was born on December 6, 1947, in Wimbledon, London, England. He was educated at Clifton College in Bristol and later attended King's College, Cambridge. Initially, Hinton switched between various subjects such as natural sciences, history of art, and philosophy before finally graduating with a Bachelor of Arts in experimental psychology in 1970 from the University of Cambridge. He went on to pursue a PhD in artificial intelligence at the University of Edinburgh, which he was awarded in 1978. His research was supervised by Christopher Longuet-Higgins [source](https://en.wikipedia.org/wiki/Geoffrey_Hinton).\n\n## Academic Career\n\nAfter obtaining his PhD, Hinton worked at the University of Sussex and later at the University of California, San Diego, and Carnegie Mellon University. He faced difficulties in securing funding in Britain, which led him to positions in the United States. Hinton was the founding director of the Gatsby Charitable Foundation Computational Neuroscience Unit at University College London. He is currently a professor in the computer science department at the University of Toronto, where he holds a Canada Research Chair in Machine Learning. Hinton is also an advisor for the Learning in Machines & Brains program at the Canadian Institute for Advanced Research as of June 2024 [source](https://www.cifar.ca/bio/geoffrey-hinton).\n\n## Contributions to Neural Networks\n\nHinton is most noted for his contributions to the field of artificial neural networks and deep learning, earning him the title \"Godfather of AI.\" In 1986, along with David Rumelhart and Ronald J. Williams, he co-authored a highly cited paper that popularized the backpropagation algorithm for training multi-layer neural networks. Although not the first to propose backpropagation, their work significantly advanced its application [source](https://www.nature.com/articles/323533a0).\n\nIn 1985, Hinton co-invented Boltzmann machines with David Ackley and Terry Sejnowski. His other notable contributions include distributed representations, time delay neural networks, mixtures of experts, and Helmholtz machines [source](https://www.cs.toronto.edu/~hinton/papers.html).\n\n## Achievements and Awards\n\nHinton has received numerous prestigious awards for his work, including:\n\n- AAAI Fellow (1990)\n- Rumelhart Prize (2001)\n- IJCAI Award for Research Excellence (2005)\n- IEEE Frank Rosenblatt Award (2014)\n- James Clerk Maxwell Medal (2016)\n- BBVA Foundation Frontiers of Knowledge Award (2016)\n- Turing Award (2018)\n- Dickson Prize (2021)\n- Princess of Asturias Award (2022)\n\nHe received the 2018 Turing Award along with Yoshua Bengio and Yann LeCun for their work on deep learning, earning them the moniker \"Godfathers of Deep Learning\" [source](https://amturing.acm.org/award_winners/hinton_4791679.cfm).\n\n## Industry Contributions and Resignation from Google\n\nHinton co-founded and became the chief scientific advisor of the Vector Institute in Toronto in 2017. From 2013 to 2023, he divided his time working at Google Brain and the University of Toronto. He publicly announced his departure from Google in May 2023, citing concerns about the risks associated with artificial intelligence technology. Hinton has voiced concerns about malicious use of AI, technological unemployment, and existential risks from artificial general intelligence. He emphasized the need for safety guidelines and cooperation among AI developers to mitigate these risks [source](https://www.bbc.com/news/world-us-canada-65452940).\n\n## Legacy and Influence\n\nHinton's influence extends through his numerous students and collaborators, many of whom are leading figures in AI and machine learning. Notable students include Ilya Sutskever, who co-founded OpenAI, and Yann LeCun, a key figure in the development of convolutional neural networks.\n\nHinton's research has had a profound impact on the field of computer vision, particularly through the development of AlexNet, in collaboration with his students Alex Krizhevsky and Ilya Sutskever, which won the ImageNet challenge in 2012. This was a significant breakthrough in the field of computer vision [source](https://papers.nips.cc/paper/2012/file/c399862d3b9d6b76c8436e924a68c45b-Paper.pdf).\n\n## Personal Life\n\nHinton's personal website can be found [here](https://www.cs.toronto.edu/~hinton/), where more information about his work and publications is available.\n\n## Conclusion\n\nGeoffrey Hinton's pioneering work in artificial neural networks and deep learning has earned him a place as one of the foremost experts in the field. His contributions have shaped modern AI research and applications, making a lasting impact on both academia and industry. Through his efforts, Hinton continues to influence the direction of AI research and its ethical considerations.",
		"markdownTimeline": "## Career Timeline\n\n- **1970**: Graduated from the University of Cambridge with a Bachelor of Arts in experimental psychology [source](https://en.wikipedia.org/wiki/Geoffrey_Hinton)\n- **1978**: Received Ph.D. in Artificial Intelligence from the University of Edinburgh [source](https://en.wikipedia.org/wiki/Geoffrey_Hinton)\n- **1985**: Co-invented Boltzmann machines with David Ackley and Terry Sejnowski [source](https://www.cs.toronto.edu/~hinton/papers.html)\n- **1986**: Co-authored a highly influential paper on backpropagation algorithm [source](https://www.nature.com/articles/323533a0)\n- **1990**: Elected as a Fellow of the Association for the Advancement of Artificial Intelligence (AAAI) [source](https://aaai.org/awards/fellows/)\n- **2001**: Awarded the Rumelhart Prize [source](https://rumelhartprize.org/prize-recipients/)\n- **2005**: Received the IJCAI Award for Research Excellence [source](https://www.ijcai.org/awards/research-excellence)\n- **2013**: Joined Google Brain while maintaining his position at the University of Toronto [source](https://www.utoronto.ca/news/artificial-intelligence-u-t-s-geoffrey-hinton-neural-networks-and-deep-learning)\n- **2014**: Awarded the IEEE Frank Rosenblatt Award [source](https://www.ieee.org/about/awards/bios/rosenblatt-recipients.html)\n- **2016**: Received the James Clerk Maxwell Medal and BBVA Foundation Frontiers of Knowledge Award [source](https://royalsociety.org/grants-schemes-awards/awards/james-clerk-maxwell-award/)\n- **2017**: Co-founded the Vector Institute in Toronto [source](https://vectorinstitute.ai/team/dr-geoffrey-hinton/)\n- **2018**: Awarded the ACM A.M. Turing Award [source](https://amturing.acm.org/award_winners/hinton_4791679.cfm)\n- **2021**: Received the Dickson Prize [source](https://www.cmu.edu/dickson-prize/)\n- **2022**: Awarded the Princess of Asturias Award [source](https://www.fpa.es/en/princess-of-asturias-awards/laureates/2022-geoffrey-hinton-yann-lecun-yoshua-bengio-and-demis-hassabis.html)\n- **2023**: Resigned from Google, citing concerns about AI risks [source](https://www.bbc.com/news/world-us-canada-65452940)",
		"slug": "geoffrey-hinton"
	},
	{
		"name": "Dr. Avi Wigderson",
		"dateTime": "November 29th, 12pm EST",
		"isoDate": "2024-11-29T12:00:00-05:00",
		"description": "Dr. Avi Wigderson, recipient of the 2023 A.M. Turing Award from the Association of Computing Machinery, has had a distinguished career spanning decades of groundbreaking contributions to computer science. In 2021, he was awarded the Abel Prize shared with László Lovász. In 2019, he published a book that is an invitation to the theory of computing, that is available for free online at https://www.math.ias.edu/avi/book/",
		"rsvpLink": "https://lu.ma/ays8rksf",
		"turingAwardWinner": true,
		"speakerPhoto": "/speaker-photos/avi.jpeg",
		"turingLink": "https://awards.acm.org/award-recipients/wigderson_3844537#2023-acm-a.m.-turing-award",
		"talkTitle": "Question & Answer",
		"recordingLink": "",
		"markdownBiography": "Learn more about Dr. Avi Wigderson on his [website](https://www.math.ias.edu/avi/home)",
		"markdownTimeline": "Learn more about Dr. Avi Wigderson on his [website](https://www.math.ias.edu/avi/home)",
		"slug": "avi-wigderson"
	},
	{
		"name": "Dr. John Hennessy",
		"dateTime": "December 6th, 1pm EST",
		"isoDate": "2024-12-06T13:00:00-05:00",
		"description": "Dr. John Hennessy, awarded the 2017 Turing Award with David Patterson, is a pioneering computer scientist whose work has fundamentally transformed computer architecture. His groundbreaking contributions to RISC processor architecture have profoundly influenced modern computer design, leading to more efficient and powerful computing systems. As a visionary leader in computer engineering education, Dr. Hennessy has shaped the field for generations of students and professionals, leaving an indelible mark on the evolution of computing technology.",
		"rsvpLink": "https://lu.ma/032al78f",
		"turingAwardWinner": true,
		"speakerPhoto": "/speaker-photos/john.jpg",
		"turingLink": "https://amturing.acm.org/award_winners/hennessy_1426931.cfm",
		"talkTitle": "Question & Answer",
		"recordingLink": "",
		"markdownBiography": "# John L. Hennessy\n\n## Early Life and Education\n\nJohn Leroy Hennessy was born on September 22, 1952, in Huntington, New York. Raised as one of six children, Hennessy's father was an aerospace engineer, and his mother was a teacher who later devoted herself to raising their children. Hennessy is of Irish-Catholic descent, with ancestors who arrived in America during the potato famine in the 19th century.\n\nHennessy earned his bachelor's degree in electrical engineering from Villanova University. He then pursued his master's and doctoral degrees in computer science at Stony Brook University, completing his PhD with a thesis titled \"A real-time language for small processors: design, definition and implementation\" in 1977 [source](http://search.proquest.com/docview/302854127).\n\n## Academic Career\n\nHennessy joined the faculty of Stanford University in 1977 as an assistant professor of electrical engineering. In 1981, he initiated the MIPS (Microprocessor without Interlocked Pipeline Stages) project, focusing on Reduced Instruction Set Computer (RISC) processors, a technology that significantly increased computing performance while reducing costs.\n\nIn 1984, during a sabbatical, Hennessy co-founded MIPS Computer Systems to commercialize the RISC technology developed through his research. MIPS had its initial public offering in 1989.\n\n### Leadership Roles at Stanford\n\n- **Director of Computer System Laboratory (1989-1993)**\n- **Chair of the Computer Science Department (1994-1996)**\n- **Dean of the School of Engineering (1996-1999)**\n- **Provost of Stanford University (1999-2000)**\n- **President of Stanford University (2000-2016)**\n\nAs the 10th President of Stanford University, Hennessy oversaw significant growth in multidisciplinary research and teaching. He prioritized making Stanford accessible and affordable, leading to one of the strongest financial aid programs in the nation. His tenure also marked a renaissance in the arts at Stanford with the establishment of new facilities including a concert hall, a home for Art and Art History, and the Anderson Collection.\n\n## Post-Presidency Contributions\n\nIn 2016, Hennessy announced the Knight-Hennessy Scholars Program, the largest fully endowed graduate-level scholarship program globally. The program aims to cultivate a new generation of leaders by providing full funding for graduate or professional degrees across Stanford's seven schools. Upon stepping down as president, Hennessy became the inaugural Shriram Family Director of the Knight-Hennessy Scholars Program [source](https://knight-hennessy.stanford.edu/).\n\n## Industry Contributions\n\n### MIPS Computer Systems\n\nHennessy's work on the MIPS project led to the establishment of MIPS Computer Systems in 1984, which became a pivotal company in the computing industry, pioneering RISC technology.\n\n### Atheros Communications\n\nIn 1998, he co-founded Atheros Communications, a leader in WiFi technology, and served as Chair of the Board until 2010.\n\n## Publications\n\nHennessy co-authored two internationally recognized textbooks on computer architecture with David Patterson, which are widely used in academic institutions globally.\n\n## Board Memberships and Honors\n\nHennessy serves on the board of the Gordon and Betty Moore Foundation and is the chair of the board of Alphabet Inc., Google's parent company. His numerous accolades include:\n\n- **Charles Stark Draper Prize for Engineering (2022)** [source](https://www.nae.edu/233474/John-L-Hennessy)\n- **IEEE Medal of Honor (2012)** [source](https://ethw.org/IEEE_Medal_of_Honor)\n- **ACM Turing Award (2017)** [source](https://amturing.acm.org/award_winners/hennessy_1098256.cfm)\n- **John von Neumann Medal (2000)**\n- **Eckert-Mauchly Award (2001)**\n- **Seymour Cray Computer Engineering Award (2001)**\n- **NEC C&C Prize (2004)**\n\nHennessy is an elected member or Fellow of several prestigious organizations, including the National Academy of Engineering, the Royal Academy of Engineering, the National Academy of Sciences, the American Academy of Arts and Sciences, and the American Philosophical Society.\n\n## Personal Life\n\nHennessy continues to influence the fields of computer science and education through his ongoing work and contributions. He remains a prominent figure in Silicon Valley and academia, revered for his innovative contributions and leadership.\n\nFor more information, you can visit his [official Stanford page](https://hennessy.stanford.edu/) and his [Wikipedia article](https://en.wikipedia.org/wiki/John_L._Hennessy).",
		"markdownTimeline": "## Career Timeline\n\n- **1977**: Received Ph.D. in Computer Science from Stony Brook University [source](http://search.proquest.com/docview/302854127)\n- **1977**: Joined Stanford University as an assistant professor of electrical engineering\n- **1981**: Initiated the MIPS project at Stanford\n- **1984**: Co-founded MIPS Computer Systems\n- **1986**: Published 'Computer Architecture: A Quantitative Approach' with David Patterson\n- **1989-1993**: Served as Director of Computer System Laboratory at Stanford\n- **1994-1996**: Chaired the Computer Science Department at Stanford\n- **1996-1999**: Served as Dean of the School of Engineering at Stanford\n- **1998**: Co-founded Atheros Communications\n- **1999-2000**: Served as Provost of Stanford University\n- **2000-2016**: Served as President of Stanford University\n- **2012**: Awarded the IEEE Medal of Honor [source](https://ethw.org/IEEE_Medal_of_Honor)\n- **2016**: Announced the Knight-Hennessy Scholars Program [source](https://knight-hennessy.stanford.edu/)\n- **2017**: Awarded the ACM Turing Award [source](https://amturing.acm.org/award_winners/hennessy_1098256.cfm)\n- **2018**: Became Chairman of Alphabet Inc.\n- **2022**: Received the Charles Stark Draper Prize for Engineering [source](https://www.nae.edu/233474/John-L-Hennessy)",
		"slug": "john-hennessy"
	}
]
